zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFAWBR-pinctrl.h
/*
 * NOTE: File generated by lpc_cfg_utils.py
 * from MIMXRT685SFAWBR/signal_configuration.xml
 *
 * Copyright (c) 2022, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MIMXRT685SFFOB-pinctrl.h with this part's differences applied
 * below (1689 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 432faede1015baa3
 */

#ifndef _ZEPHYR_DTS_BINDING_MIMXRT685SFAWBR_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MIMXRT685SFAWBR_WRAPPER_

#include "MIMXRT685SFFOB-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_CH13_PIO3_24
#undef ADC0_CH5_PIO3_23
#undef CLKIN_PIO4_1
#undef CLKOUT_PIO4_0
#undef CMP0_OUT_PIO2_13
#undef CMP0_OUT_PIO3_3
#undef CMP0_OUT_PIO4_8
#undef CTIMER0_CAPTURE0_PIO0_18
#undef CTIMER0_CAPTURE0_PIO1_0
#undef CTIMER0_CAPTURE0_PIO1_29
#undef CTIMER0_CAPTURE0_PIO1_7
#undef CTIMER0_CAPTURE0_PIO3_12
#undef CTIMER0_CAPTURE0_PIO3_13
#undef CTIMER0_CAPTURE1_PIO0_18
#undef CTIMER0_CAPTURE1_PIO1_0
#undef CTIMER0_CAPTURE1_PIO1_29
#undef CTIMER0_CAPTURE1_PIO1_7
#undef CTIMER0_CAPTURE1_PIO3_12
#undef CTIMER0_CAPTURE1_PIO3_13
#undef CTIMER0_CAPTURE2_PIO0_18
#undef CTIMER0_CAPTURE2_PIO1_0
#undef CTIMER0_CAPTURE2_PIO1_29
#undef CTIMER0_CAPTURE2_PIO1_7
#undef CTIMER0_CAPTURE2_PIO3_12
#undef CTIMER0_CAPTURE2_PIO3_13
#undef CTIMER0_CAPTURE3_PIO0_18
#undef CTIMER0_CAPTURE3_PIO1_0
#undef CTIMER0_CAPTURE3_PIO1_29
#undef CTIMER0_CAPTURE3_PIO1_7
#undef CTIMER0_CAPTURE3_PIO3_12
#undef CTIMER0_CAPTURE3_PIO3_13
#undef CTIMER0_MATCH0_PIO3_8
#undef CTIMER0_MATCH1_PIO3_9
#undef CTIMER0_MATCH2_PIO3_10
#undef CTIMER0_MATCH3_PIO3_11
#undef CTIMER1_CAPTURE0_PIO0_18
#undef CTIMER1_CAPTURE0_PIO1_0
#undef CTIMER1_CAPTURE0_PIO1_29
#undef CTIMER1_CAPTURE0_PIO1_7
#undef CTIMER1_CAPTURE0_PIO3_12
#undef CTIMER1_CAPTURE0_PIO3_13
#undef CTIMER1_CAPTURE1_PIO0_18
#undef CTIMER1_CAPTURE1_PIO1_0
#undef CTIMER1_CAPTURE1_PIO1_29
#undef CTIMER1_CAPTURE1_PIO1_7
#undef CTIMER1_CAPTURE1_PIO3_12
#undef CTIMER1_CAPTURE1_PIO3_13
#undef CTIMER1_CAPTURE2_PIO0_18
#undef CTIMER1_CAPTURE2_PIO1_0
#undef CTIMER1_CAPTURE2_PIO1_29
#undef CTIMER1_CAPTURE2_PIO1_7
#undef CTIMER1_CAPTURE2_PIO3_12
#undef CTIMER1_CAPTURE2_PIO3_13
#undef CTIMER1_CAPTURE3_PIO0_18
#undef CTIMER1_CAPTURE3_PIO1_0
#undef CTIMER1_CAPTURE3_PIO1_29
#undef CTIMER1_CAPTURE3_PIO1_7
#undef CTIMER1_CAPTURE3_PIO3_12
#undef CTIMER1_CAPTURE3_PIO3_13
#undef CTIMER1_MATCH0_PIO1_1
#undef CTIMER1_MATCH0_PIO2_6
#undef CTIMER1_MATCH1_PIO2_7
#undef CTIMER1_MATCH2_PIO2_8
#undef CTIMER1_MATCH3_PIO2_9
#undef CTIMER2_CAPTURE0_PIO0_18
#undef CTIMER2_CAPTURE0_PIO1_0
#undef CTIMER2_CAPTURE0_PIO1_29
#undef CTIMER2_CAPTURE0_PIO1_7
#undef CTIMER2_CAPTURE0_PIO3_12
#undef CTIMER2_CAPTURE0_PIO3_13
#undef CTIMER2_CAPTURE1_PIO0_18
#undef CTIMER2_CAPTURE1_PIO1_0
#undef CTIMER2_CAPTURE1_PIO1_29
#undef CTIMER2_CAPTURE1_PIO1_7
#undef CTIMER2_CAPTURE1_PIO3_12
#undef CTIMER2_CAPTURE1_PIO3_13
#undef CTIMER2_CAPTURE2_PIO0_18
#undef CTIMER2_CAPTURE2_PIO1_0
#undef CTIMER2_CAPTURE2_PIO1_29
#undef CTIMER2_CAPTURE2_PIO1_7
#undef CTIMER2_CAPTURE2_PIO3_12
#undef CTIMER2_CAPTURE2_PIO3_13
#undef CTIMER2_CAPTURE3_PIO0_18
#undef CTIMER2_CAPTURE3_PIO1_0
#undef CTIMER2_CAPTURE3_PIO1_29
#undef CTIMER2_CAPTURE3_PIO1_7
#undef CTIMER2_CAPTURE3_PIO3_12
#undef CTIMER2_CAPTURE3_PIO3_13
#undef CTIMER2_MATCH0_PIO2_10
#undef CTIMER2_MATCH1_PIO2_11
#undef CTIMER2_MATCH2_PIO2_12
#undef CTIMER2_MATCH3_PIO0_17
#undef CTIMER2_MATCH3_PIO2_13
#undef CTIMER3_CAPTURE0_PIO0_18
#undef CTIMER3_CAPTURE0_PIO1_0
#undef CTIMER3_CAPTURE0_PIO1_29
#undef CTIMER3_CAPTURE0_PIO1_7
#undef CTIMER3_CAPTURE0_PIO3_12
#undef CTIMER3_CAPTURE0_PIO3_13
#undef CTIMER3_CAPTURE1_PIO0_18
#undef CTIMER3_CAPTURE1_PIO1_0
#undef CTIMER3_CAPTURE1_PIO1_29
#undef CTIMER3_CAPTURE1_PIO1_7
#undef CTIMER3_CAPTURE1_PIO3_12
#undef CTIMER3_CAPTURE1_PIO3_13
#undef CTIMER3_CAPTURE2_PIO0_18
#undef CTIMER3_CAPTURE2_PIO1_0
#undef CTIMER3_CAPTURE2_PIO1_29
#undef CTIMER3_CAPTURE2_PIO1_7
#undef CTIMER3_CAPTURE2_PIO3_12
#undef CTIMER3_CAPTURE2_PIO3_13
#undef CTIMER3_CAPTURE3_PIO0_18
#undef CTIMER3_CAPTURE3_PIO1_0
#undef CTIMER3_CAPTURE3_PIO1_29
#undef CTIMER3_CAPTURE3_PIO1_7
#undef CTIMER3_CAPTURE3_PIO3_12
#undef CTIMER3_CAPTURE3_PIO3_13
#undef CTIMER3_MATCH0_PIO3_14
#undef CTIMER3_MATCH1_PIO3_15
#undef CTIMER3_MATCH2_PIO3_16
#undef CTIMER3_MATCH3_PIO3_17
#undef CTIMER4_CAPTURE0_PIO0_18
#undef CTIMER4_CAPTURE0_PIO1_0
#undef CTIMER4_CAPTURE0_PIO1_29
#undef CTIMER4_CAPTURE0_PIO1_7
#undef CTIMER4_CAPTURE0_PIO3_12
#undef CTIMER4_CAPTURE0_PIO3_13
#undef CTIMER4_CAPTURE1_PIO0_18
#undef CTIMER4_CAPTURE1_PIO1_0
#undef CTIMER4_CAPTURE1_PIO1_29
#undef CTIMER4_CAPTURE1_PIO1_7
#undef CTIMER4_CAPTURE1_PIO3_12
#undef CTIMER4_CAPTURE1_PIO3_13
#undef CTIMER4_CAPTURE2_PIO0_18
#undef CTIMER4_CAPTURE2_PIO1_0
#undef CTIMER4_CAPTURE2_PIO1_29
#undef CTIMER4_CAPTURE2_PIO1_7
#undef CTIMER4_CAPTURE2_PIO3_12
#undef CTIMER4_CAPTURE2_PIO3_13
#undef CTIMER4_CAPTURE3_PIO0_18
#undef CTIMER4_CAPTURE3_PIO1_0
#undef CTIMER4_CAPTURE3_PIO1_29
#undef CTIMER4_CAPTURE3_PIO1_7
#undef CTIMER4_CAPTURE3_PIO3_12
#undef CTIMER4_CAPTURE3_PIO3_13
#undef CTIMER4_MATCH0_PIO0_28
#undef CTIMER4_MATCH0_PIO3_18
#undef CTIMER4_MATCH1_PIO3_19
#undef CTIMER4_MATCH2_PIO3_20
#undef CTIMER4_MATCH3_PIO0_31
#undef CTIMER4_MATCH3_PIO3_21
#undef DMA0_TRIG0_PIO0_17
#undef DMA0_TRIG0_PIO0_18
#undef DMA0_TRIG0_PIO0_28
#undef DMA0_TRIG0_PIO0_31
#undef DMA0_TRIG0_PIO1_0
#undef DMA0_TRIG0_PIO1_1
#undef DMA0_TRIG0_PIO1_24
#undef DMA0_TRIG0_PIO1_25
#undef DMA0_TRIG0_PIO1_26
#undef DMA0_TRIG0_PIO1_27
#undef DMA0_TRIG0_PIO1_28
#undef DMA0_TRIG0_PIO1_29
#undef DMA0_TRIG0_PIO1_30
#undef DMA0_TRIG0_PIO1_31
#undef DMA0_TRIG0_PIO1_6
#undef DMA0_TRIG0_PIO1_7
#undef DMA0_TRIG10_PIO0_17
#undef DMA0_TRIG10_PIO0_18
#undef DMA0_TRIG10_PIO0_28
#undef DMA0_TRIG10_PIO0_31
#undef DMA0_TRIG10_PIO1_0
#undef DMA0_TRIG10_PIO1_1
#undef DMA0_TRIG10_PIO1_24
#undef DMA0_TRIG10_PIO1_25
#undef DMA0_TRIG10_PIO1_26
#undef DMA0_TRIG10_PIO1_27
#undef DMA0_TRIG10_PIO1_28
#undef DMA0_TRIG10_PIO1_29
#undef DMA0_TRIG10_PIO1_30
#undef DMA0_TRIG10_PIO1_31
#undef DMA0_TRIG10_PIO1_6
#undef DMA0_TRIG10_PIO1_7
#undef DMA0_TRIG11_PIO0_17
#undef DMA0_TRIG11_PIO0_18
#undef DMA0_TRIG11_PIO0_28
#undef DMA0_TRIG11_PIO0_31
#undef DMA0_TRIG11_PIO1_0
#undef DMA0_TRIG11_PIO1_1
#undef DMA0_TRIG11_PIO1_24
#undef DMA0_TRIG11_PIO1_25
#undef DMA0_TRIG11_PIO1_26
#undef DMA0_TRIG11_PIO1_27
#undef DMA0_TRIG11_PIO1_28
#undef DMA0_TRIG11_PIO1_29
#undef DMA0_TRIG11_PIO1_30
#undef DMA0_TRIG11_PIO1_31
#undef DMA0_TRIG11_PIO1_6
#undef DMA0_TRIG11_PIO1_7
#undef DMA0_TRIG12_PIO0_17
#undef DMA0_TRIG12_PIO0_18
#undef DMA0_TRIG12_PIO0_28
#undef DMA0_TRIG12_PIO0_31
#undef DMA0_TRIG12_PIO1_0
#undef DMA0_TRIG12_PIO1_1
#undef DMA0_TRIG12_PIO1_24
#undef DMA0_TRIG12_PIO1_25
#undef DMA0_TRIG12_PIO1_26
#undef DMA0_TRIG12_PIO1_27
#undef DMA0_TRIG12_PIO1_28
#undef DMA0_TRIG12_PIO1_29
#undef DMA0_TRIG12_PIO1_30
#undef DMA0_TRIG12_PIO1_31
#undef DMA0_TRIG12_PIO1_6
#undef DMA0_TRIG12_PIO1_7
#undef DMA0_TRIG13_PIO0_17
#undef DMA0_TRIG13_PIO0_18
#undef DMA0_TRIG13_PIO0_28
#undef DMA0_TRIG13_PIO0_31
#undef DMA0_TRIG13_PIO1_0
#undef DMA0_TRIG13_PIO1_1
#undef DMA0_TRIG13_PIO1_24
#undef DMA0_TRIG13_PIO1_25
#undef DMA0_TRIG13_PIO1_26
#undef DMA0_TRIG13_PIO1_27
#undef DMA0_TRIG13_PIO1_28
#undef DMA0_TRIG13_PIO1_29
#undef DMA0_TRIG13_PIO1_30
#undef DMA0_TRIG13_PIO1_31
#undef DMA0_TRIG13_PIO1_6
#undef DMA0_TRIG13_PIO1_7
#undef DMA0_TRIG14_PIO0_17
#undef DMA0_TRIG14_PIO0_18
#undef DMA0_TRIG14_PIO0_28
#undef DMA0_TRIG14_PIO0_31
#undef DMA0_TRIG14_PIO1_0
#undef DMA0_TRIG14_PIO1_1
#undef DMA0_TRIG14_PIO1_24
#undef DMA0_TRIG14_PIO1_25
#undef DMA0_TRIG14_PIO1_26
#undef DMA0_TRIG14_PIO1_27
#undef DMA0_TRIG14_PIO1_28
#undef DMA0_TRIG14_PIO1_29
#undef DMA0_TRIG14_PIO1_30
#undef DMA0_TRIG14_PIO1_31
#undef DMA0_TRIG14_PIO1_6
#undef DMA0_TRIG14_PIO1_7
#undef DMA0_TRIG15_PIO0_17
#undef DMA0_TRIG15_PIO0_18
#undef DMA0_TRIG15_PIO0_28
#undef DMA0_TRIG15_PIO0_31
#undef DMA0_TRIG15_PIO1_0
#undef DMA0_TRIG15_PIO1_1
#undef DMA0_TRIG15_PIO1_24
#undef DMA0_TRIG15_PIO1_25
#undef DMA0_TRIG15_PIO1_26
#undef DMA0_TRIG15_PIO1_27
#undef DMA0_TRIG15_PIO1_28
#undef DMA0_TRIG15_PIO1_29
#undef DMA0_TRIG15_PIO1_30
#undef DMA0_TRIG15_PIO1_31
#undef DMA0_TRIG15_PIO1_6
#undef DMA0_TRIG15_PIO1_7
#undef DMA0_TRIG16_PIO0_17
#undef DMA0_TRIG16_PIO0_18
#undef DMA0_TRIG16_PIO0_28
#undef DMA0_TRIG16_PIO0_31
#undef DMA0_TRIG16_PIO1_0
#undef DMA0_TRIG16_PIO1_1
#undef DMA0_TRIG16_PIO1_24
#undef DMA0_TRIG16_PIO1_25
#undef DMA0_TRIG16_PIO1_26
#undef DMA0_TRIG16_PIO1_27
#undef DMA0_TRIG16_PIO1_28
#undef DMA0_TRIG16_PIO1_29
#undef DMA0_TRIG16_PIO1_30
#undef DMA0_TRIG16_PIO1_31
#undef DMA0_TRIG16_PIO1_6
#undef DMA0_TRIG16_PIO1_7
#undef DMA0_TRIG17_PIO0_17
#undef DMA0_TRIG17_PIO0_18
#undef DMA0_TRIG17_PIO0_28
#undef DMA0_TRIG17_PIO0_31
#undef DMA0_TRIG17_PIO1_0
#undef DMA0_TRIG17_PIO1_1
#undef DMA0_TRIG17_PIO1_24
#undef DMA0_TRIG17_PIO1_25
#undef DMA0_TRIG17_PIO1_26
#undef DMA0_TRIG17_PIO1_27
#undef DMA0_TRIG17_PIO1_28
#undef DMA0_TRIG17_PIO1_29
#undef DMA0_TRIG17_PIO1_30
#undef DMA0_TRIG17_PIO1_31
#undef DMA0_TRIG17_PIO1_6
#undef DMA0_TRIG17_PIO1_7
#undef DMA0_TRIG18_PIO0_17
#undef DMA0_TRIG18_PIO0_18
#undef DMA0_TRIG18_PIO0_28
#undef DMA0_TRIG18_PIO0_31
#undef DMA0_TRIG18_PIO1_0
#undef DMA0_TRIG18_PIO1_1
#undef DMA0_TRIG18_PIO1_24
#undef DMA0_TRIG18_PIO1_25
#undef DMA0_TRIG18_PIO1_26
#undef DMA0_TRIG18_PIO1_27
#undef DMA0_TRIG18_PIO1_28
#undef DMA0_TRIG18_PIO1_29
#undef DMA0_TRIG18_PIO1_30
#undef DMA0_TRIG18_PIO1_31
#undef DMA0_TRIG18_PIO1_6
#undef DMA0_TRIG18_PIO1_7
#undef DMA0_TRIG19_PIO0_17
#undef DMA0_TRIG19_PIO0_18
#undef DMA0_TRIG19_PIO0_28
#undef DMA0_TRIG19_PIO0_31
#undef DMA0_TRIG19_PIO1_0
#undef DMA0_TRIG19_PIO1_1
#undef DMA0_TRIG19_PIO1_24
#undef DMA0_TRIG19_PIO1_25
#undef DMA0_TRIG19_PIO1_26
#undef DMA0_TRIG19_PIO1_27
#undef DMA0_TRIG19_PIO1_28
#undef DMA0_TRIG19_PIO1_29
#undef DMA0_TRIG19_PIO1_30
#undef DMA0_TRIG19_PIO1_31
#undef DMA0_TRIG19_PIO1_6
#undef DMA0_TRIG19_PIO1_7
#undef DMA0_TRIG1_PIO0_17
#undef DMA0_TRIG1_PIO0_18
#undef DMA0_TRIG1_PIO0_28
#undef DMA0_TRIG1_PIO0_31
#undef DMA0_TRIG1_PIO1_0
#undef DMA0_TRIG1_PIO1_1
#undef DMA0_TRIG1_PIO1_24
#undef DMA0_TRIG1_PIO1_25
#undef DMA0_TRIG1_PIO1_26
#undef DMA0_TRIG1_PIO1_27
#undef DMA0_TRIG1_PIO1_28
#undef DMA0_TRIG1_PIO1_29
#undef DMA0_TRIG1_PIO1_30
#undef DMA0_TRIG1_PIO1_31
#undef DMA0_TRIG1_PIO1_6
#undef DMA0_TRIG1_PIO1_7
#undef DMA0_TRIG20_PIO0_17
#undef DMA0_TRIG20_PIO0_18
#undef DMA0_TRIG20_PIO0_28
#undef DMA0_TRIG20_PIO0_31
#undef DMA0_TRIG20_PIO1_0
#undef DMA0_TRIG20_PIO1_1
#undef DMA0_TRIG20_PIO1_24
#undef DMA0_TRIG20_PIO1_25
#undef DMA0_TRIG20_PIO1_26
#undef DMA0_TRIG20_PIO1_27
#undef DMA0_TRIG20_PIO1_28
#undef DMA0_TRIG20_PIO1_29
#undef DMA0_TRIG20_PIO1_30
#undef DMA0_TRIG20_PIO1_31
#undef DMA0_TRIG20_PIO1_6
#undef DMA0_TRIG20_PIO1_7
#undef DMA0_TRIG21_PIO0_17
#undef DMA0_TRIG21_PIO0_18
#undef DMA0_TRIG21_PIO0_28
#undef DMA0_TRIG21_PIO0_31
#undef DMA0_TRIG21_PIO1_0
#undef DMA0_TRIG21_PIO1_1
#undef DMA0_TRIG21_PIO1_24
#undef DMA0_TRIG21_PIO1_25
#undef DMA0_TRIG21_PIO1_26
#undef DMA0_TRIG21_PIO1_27
#undef DMA0_TRIG21_PIO1_28
#undef DMA0_TRIG21_PIO1_29
#undef DMA0_TRIG21_PIO1_30
#undef DMA0_TRIG21_PIO1_31
#undef DMA0_TRIG21_PIO1_6
#undef DMA0_TRIG21_PIO1_7
#undef DMA0_TRIG22_PIO0_17
#undef DMA0_TRIG22_PIO0_18
#undef DMA0_TRIG22_PIO0_28
#undef DMA0_TRIG22_PIO0_31
#undef DMA0_TRIG22_PIO1_0
#undef DMA0_TRIG22_PIO1_1
#undef DMA0_TRIG22_PIO1_24
#undef DMA0_TRIG22_PIO1_25
#undef DMA0_TRIG22_PIO1_26
#undef DMA0_TRIG22_PIO1_27
#undef DMA0_TRIG22_PIO1_28
#undef DMA0_TRIG22_PIO1_29
#undef DMA0_TRIG22_PIO1_30
#undef DMA0_TRIG22_PIO1_31
#undef DMA0_TRIG22_PIO1_6
#undef DMA0_TRIG22_PIO1_7
#undef DMA0_TRIG23_PIO0_17
#undef DMA0_TRIG23_PIO0_18
#undef DMA0_TRIG23_PIO0_28
#undef DMA0_TRIG23_PIO0_31
#undef DMA0_TRIG23_PIO1_0
#undef DMA0_TRIG23_PIO1_1
#undef DMA0_TRIG23_PIO1_24
#undef DMA0_TRIG23_PIO1_25
#undef DMA0_TRIG23_PIO1_26
#undef DMA0_TRIG23_PIO1_27
#undef DMA0_TRIG23_PIO1_28
#undef DMA0_TRIG23_PIO1_29
#undef DMA0_TRIG23_PIO1_30
#undef DMA0_TRIG23_PIO1_31
#undef DMA0_TRIG23_PIO1_6
#undef DMA0_TRIG23_PIO1_7
#undef DMA0_TRIG24_PIO0_17
#undef DMA0_TRIG24_PIO0_18
#undef DMA0_TRIG24_PIO0_28
#undef DMA0_TRIG24_PIO0_31
#undef DMA0_TRIG24_PIO1_0
#undef DMA0_TRIG24_PIO1_1
#undef DMA0_TRIG24_PIO1_24
#undef DMA0_TRIG24_PIO1_25
#undef DMA0_TRIG24_PIO1_26
#undef DMA0_TRIG24_PIO1_27
#undef DMA0_TRIG24_PIO1_28
#undef DMA0_TRIG24_PIO1_29
#undef DMA0_TRIG24_PIO1_30
#undef DMA0_TRIG24_PIO1_31
#undef DMA0_TRIG24_PIO1_6
#undef DMA0_TRIG24_PIO1_7
#undef DMA0_TRIG25_PIO0_17
#undef DMA0_TRIG25_PIO0_18
#undef DMA0_TRIG25_PIO0_28
#undef DMA0_TRIG25_PIO0_31
#undef DMA0_TRIG25_PIO1_0
#undef DMA0_TRIG25_PIO1_1
#undef DMA0_TRIG25_PIO1_24
#undef DMA0_TRIG25_PIO1_25
#undef DMA0_TRIG25_PIO1_26
#undef DMA0_TRIG25_PIO1_27
#undef DMA0_TRIG25_PIO1_28
#undef DMA0_TRIG25_PIO1_29
#undef DMA0_TRIG25_PIO1_30
#undef DMA0_TRIG25_PIO1_31
#undef DMA0_TRIG25_PIO1_6
#undef DMA0_TRIG25_PIO1_7
#undef DMA0_TRIG26_PIO0_17
#undef DMA0_TRIG26_PIO0_18
#undef DMA0_TRIG26_PIO0_28
#undef DMA0_TRIG26_PIO0_31
#undef DMA0_TRIG26_PIO1_0
#undef DMA0_TRIG26_PIO1_1
#undef DMA0_TRIG26_PIO1_24
#undef DMA0_TRIG26_PIO1_25
#undef DMA0_TRIG26_PIO1_26
#undef DMA0_TRIG26_PIO1_27
#undef DMA0_TRIG26_PIO1_28
#undef DMA0_TRIG26_PIO1_29
#undef DMA0_TRIG26_PIO1_30
#undef DMA0_TRIG26_PIO1_31
#undef DMA0_TRIG26_PIO1_6
#undef DMA0_TRIG26_PIO1_7
#undef DMA0_TRIG27_PIO0_17
#undef DMA0_TRIG27_PIO0_18
#undef DMA0_TRIG27_PIO0_28
#undef DMA0_TRIG27_PIO0_31
#undef DMA0_TRIG27_PIO1_0
#undef DMA0_TRIG27_PIO1_1
#undef DMA0_TRIG27_PIO1_24
#undef DMA0_TRIG27_PIO1_25
#undef DMA0_TRIG27_PIO1_26
#undef DMA0_TRIG27_PIO1_27
#undef DMA0_TRIG27_PIO1_28
#undef DMA0_TRIG27_PIO1_29
#undef DMA0_TRIG27_PIO1_30
#undef DMA0_TRIG27_PIO1_31
#undef DMA0_TRIG27_PIO1_6
#undef DMA0_TRIG27_PIO1_7
#undef DMA0_TRIG28_PIO0_17
#undef DMA0_TRIG28_PIO0_18
#undef DMA0_TRIG28_PIO0_28
#undef DMA0_TRIG28_PIO0_31
#undef DMA0_TRIG28_PIO1_0
#undef DMA0_TRIG28_PIO1_1
#undef DMA0_TRIG28_PIO1_24
#undef DMA0_TRIG28_PIO1_25
#undef DMA0_TRIG28_PIO1_26
#undef DMA0_TRIG28_PIO1_27
#undef DMA0_TRIG28_PIO1_28
#undef DMA0_TRIG28_PIO1_29
#undef DMA0_TRIG28_PIO1_30
#undef DMA0_TRIG28_PIO1_31
#undef DMA0_TRIG28_PIO1_6
#undef DMA0_TRIG28_PIO1_7
#undef DMA0_TRIG29_PIO0_17
#undef DMA0_TRIG29_PIO0_18
#undef DMA0_TRIG29_PIO0_28
#undef DMA0_TRIG29_PIO0_31
#undef DMA0_TRIG29_PIO1_0
#undef DMA0_TRIG29_PIO1_1
#undef DMA0_TRIG29_PIO1_24
#undef DMA0_TRIG29_PIO1_25
#undef DMA0_TRIG29_PIO1_26
#undef DMA0_TRIG29_PIO1_27
#undef DMA0_TRIG29_PIO1_28
#undef DMA0_TRIG29_PIO1_29
#undef DMA0_TRIG29_PIO1_30
#undef DMA0_TRIG29_PIO1_31
#undef DMA0_TRIG29_PIO1_6
#undef DMA0_TRIG29_PIO1_7
#undef DMA0_TRIG2_PIO0_17
#undef DMA0_TRIG2_PIO0_18
#undef DMA0_TRIG2_PIO0_28
#undef DMA0_TRIG2_PIO0_31
#undef DMA0_TRIG2_PIO1_0
#undef DMA0_TRIG2_PIO1_1
#undef DMA0_TRIG2_PIO1_24
#undef DMA0_TRIG2_PIO1_25
#undef DMA0_TRIG2_PIO1_26
#undef DMA0_TRIG2_PIO1_27
#undef DMA0_TRIG2_PIO1_28
#undef DMA0_TRIG2_PIO1_29
#undef DMA0_TRIG2_PIO1_30
#undef DMA0_TRIG2_PIO1_31
#undef DMA0_TRIG2_PIO1_6
#undef DMA0_TRIG2_PIO1_7
#undef DMA0_TRIG30_PIO0_17
#undef DMA0_TRIG30_PIO0_18
#undef DMA0_TRIG30_PIO0_28
#undef DMA0_TRIG30_PIO0_31
#undef DMA0_TRIG30_PIO1_0
#undef DMA0_TRIG30_PIO1_1
#undef DMA0_TRIG30_PIO1_24
#undef DMA0_TRIG30_PIO1_25
#undef DMA0_TRIG30_PIO1_26
#undef DMA0_TRIG30_PIO1_27
#undef DMA0_TRIG30_PIO1_28
#undef DMA0_TRIG30_PIO1_29
#undef DMA0_TRIG30_PIO1_30
#undef DMA0_TRIG30_PIO1_31
#undef DMA0_TRIG30_PIO1_6
#undef DMA0_TRIG30_PIO1_7
#undef DMA0_TRIG31_PIO0_17
#undef DMA0_TRIG31_PIO0_18
#undef DMA0_TRIG31_PIO0_28
#undef DMA0_TRIG31_PIO0_31
#undef DMA0_TRIG31_PIO1_0
#undef DMA0_TRIG31_PIO1_1
#undef DMA0_TRIG31_PIO1_24
#undef DMA0_TRIG31_PIO1_25
#undef DMA0_TRIG31_PIO1_26
#undef DMA0_TRIG31_PIO1_27
#undef DMA0_TRIG31_PIO1_28
#undef DMA0_TRIG31_PIO1_29
#undef DMA0_TRIG31_PIO1_30
#undef DMA0_TRIG31_PIO1_31
#undef DMA0_TRIG31_PIO1_6
#undef DMA0_TRIG31_PIO1_7
#undef DMA0_TRIG32_PIO0_17
#undef DMA0_TRIG32_PIO0_18
#undef DMA0_TRIG32_PIO0_28
#undef DMA0_TRIG32_PIO0_31
#undef DMA0_TRIG32_PIO1_0
#undef DMA0_TRIG32_PIO1_1
#undef DMA0_TRIG32_PIO1_24
#undef DMA0_TRIG32_PIO1_25
#undef DMA0_TRIG32_PIO1_26
#undef DMA0_TRIG32_PIO1_27
#undef DMA0_TRIG32_PIO1_28
#undef DMA0_TRIG32_PIO1_29
#undef DMA0_TRIG32_PIO1_30
#undef DMA0_TRIG32_PIO1_31
#undef DMA0_TRIG32_PIO1_6
#undef DMA0_TRIG32_PIO1_7
#undef DMA0_TRIG3_PIO0_17
#undef DMA0_TRIG3_PIO0_18
#undef DMA0_TRIG3_PIO0_28
#undef DMA0_TRIG3_PIO0_31
#undef DMA0_TRIG3_PIO1_0
#undef DMA0_TRIG3_PIO1_1
#undef DMA0_TRIG3_PIO1_24
#undef DMA0_TRIG3_PIO1_25
#undef DMA0_TRIG3_PIO1_26
#undef DMA0_TRIG3_PIO1_27
#undef DMA0_TRIG3_PIO1_28
#undef DMA0_TRIG3_PIO1_29
#undef DMA0_TRIG3_PIO1_30
#undef DMA0_TRIG3_PIO1_31
#undef DMA0_TRIG3_PIO1_6
#undef DMA0_TRIG3_PIO1_7
#undef DMA0_TRIG4_PIO0_17
#undef DMA0_TRIG4_PIO0_18
#undef DMA0_TRIG4_PIO0_28
#undef DMA0_TRIG4_PIO0_31
#undef DMA0_TRIG4_PIO1_0
#undef DMA0_TRIG4_PIO1_1
#undef DMA0_TRIG4_PIO1_24
#undef DMA0_TRIG4_PIO1_25
#undef DMA0_TRIG4_PIO1_26
#undef DMA0_TRIG4_PIO1_27
#undef DMA0_TRIG4_PIO1_28
#undef DMA0_TRIG4_PIO1_29
#undef DMA0_TRIG4_PIO1_30
#undef DMA0_TRIG4_PIO1_31
#undef DMA0_TRIG4_PIO1_6
#undef DMA0_TRIG4_PIO1_7
#undef DMA0_TRIG5_PIO0_17
#undef DMA0_TRIG5_PIO0_18
#undef DMA0_TRIG5_PIO0_28
#undef DMA0_TRIG5_PIO0_31
#undef DMA0_TRIG5_PIO1_0
#undef DMA0_TRIG5_PIO1_1
#undef DMA0_TRIG5_PIO1_24
#undef DMA0_TRIG5_PIO1_25
#undef DMA0_TRIG5_PIO1_26
#undef DMA0_TRIG5_PIO1_27
#undef DMA0_TRIG5_PIO1_28
#undef DMA0_TRIG5_PIO1_29
#undef DMA0_TRIG5_PIO1_30
#undef DMA0_TRIG5_PIO1_31
#undef DMA0_TRIG5_PIO1_6
#undef DMA0_TRIG5_PIO1_7
#undef DMA0_TRIG6_PIO0_17
#undef DMA0_TRIG6_PIO0_18
#undef DMA0_TRIG6_PIO0_28
#undef DMA0_TRIG6_PIO0_31
#undef DMA0_TRIG6_PIO1_0
#undef DMA0_TRIG6_PIO1_1
#undef DMA0_TRIG6_PIO1_24
#undef DMA0_TRIG6_PIO1_25
#undef DMA0_TRIG6_PIO1_26
#undef DMA0_TRIG6_PIO1_27
#undef DMA0_TRIG6_PIO1_28
#undef DMA0_TRIG6_PIO1_29
#undef DMA0_TRIG6_PIO1_30
#undef DMA0_TRIG6_PIO1_31
#undef DMA0_TRIG6_PIO1_6
#undef DMA0_TRIG6_PIO1_7
#undef DMA0_TRIG7_PIO0_17
#undef DMA0_TRIG7_PIO0_18
#undef DMA0_TRIG7_PIO0_28
#undef DMA0_TRIG7_PIO0_31
#undef DMA0_TRIG7_PIO1_0
#undef DMA0_TRIG7_PIO1_1
#undef DMA0_TRIG7_PIO1_24
#undef DMA0_TRIG7_PIO1_25
#undef DMA0_TRIG7_PIO1_26
#undef DMA0_TRIG7_PIO1_27
#undef DMA0_TRIG7_PIO1_28
#undef DMA0_TRIG7_PIO1_29
#undef DMA0_TRIG7_PIO1_30
#undef DMA0_TRIG7_PIO1_31
#undef DMA0_TRIG7_PIO1_6
#undef DMA0_TRIG7_PIO1_7
#undef DMA0_TRIG8_PIO0_17
#undef DMA0_TRIG8_PIO0_18
#undef DMA0_TRIG8_PIO0_28
#undef DMA0_TRIG8_PIO0_31
#undef DMA0_TRIG8_PIO1_0
#undef DMA0_TRIG8_PIO1_1
#undef DMA0_TRIG8_PIO1_24
#undef DMA0_TRIG8_PIO1_25
#undef DMA0_TRIG8_PIO1_26
#undef DMA0_TRIG8_PIO1_27
#undef DMA0_TRIG8_PIO1_28
#undef DMA0_TRIG8_PIO1_29
#undef DMA0_TRIG8_PIO1_30
#undef DMA0_TRIG8_PIO1_31
#undef DMA0_TRIG8_PIO1_6
#undef DMA0_TRIG8_PIO1_7
#undef DMA0_TRIG9_PIO0_17
#undef DMA0_TRIG9_PIO0_18
#undef DMA0_TRIG9_PIO0_28
#undef DMA0_TRIG9_PIO0_31
#undef DMA0_TRIG9_PIO1_0
#undef DMA0_TRIG9_PIO1_1
#undef DMA0_TRIG9_PIO1_24
#undef DMA0_TRIG9_PIO1_25
#undef DMA0_TRIG9_PIO1_26
#undef DMA0_TRIG9_PIO1_27
#undef DMA0_TRIG9_PIO1_28
#undef DMA0_TRIG9_PIO1_29
#undef DMA0_TRIG9_PIO1_30
#undef DMA0_TRIG9_PIO1_31
#undef DMA0_TRIG9_PIO1_6
#undef DMA0_TRIG9_PIO1_7
#undef DMA1_TRIG0_PIO0_17
#undef DMA1_TRIG0_PIO0_18
#undef DMA1_TRIG0_PIO0_28
#undef DMA1_TRIG0_PIO0_31
#undef DMA1_TRIG0_PIO1_0
#undef DMA1_TRIG0_PIO1_1
#undef DMA1_TRIG0_PIO1_24
#undef DMA1_TRIG0_PIO1_25
#undef DMA1_TRIG0_PIO1_26
#undef DMA1_TRIG0_PIO1_27
#undef DMA1_TRIG0_PIO1_28
#undef DMA1_TRIG0_PIO1_29
#undef DMA1_TRIG0_PIO1_30
#undef DMA1_TRIG0_PIO1_31
#undef DMA1_TRIG0_PIO1_6
#undef DMA1_TRIG0_PIO1_7
#undef DMA1_TRIG10_PIO0_17
#undef DMA1_TRIG10_PIO0_18
#undef DMA1_TRIG10_PIO0_28
#undef DMA1_TRIG10_PIO0_31
#undef DMA1_TRIG10_PIO1_0
#undef DMA1_TRIG10_PIO1_1
#undef DMA1_TRIG10_PIO1_24
#undef DMA1_TRIG10_PIO1_25
#undef DMA1_TRIG10_PIO1_26
#undef DMA1_TRIG10_PIO1_27
#undef DMA1_TRIG10_PIO1_28
#undef DMA1_TRIG10_PIO1_29
#undef DMA1_TRIG10_PIO1_30
#undef DMA1_TRIG10_PIO1_31
#undef DMA1_TRIG10_PIO1_6
#undef DMA1_TRIG10_PIO1_7
#undef DMA1_TRIG11_PIO0_17
#undef DMA1_TRIG11_PIO0_18
#undef DMA1_TRIG11_PIO0_28
#undef DMA1_TRIG11_PIO0_31
#undef DMA1_TRIG11_PIO1_0
#undef DMA1_TRIG11_PIO1_1
#undef DMA1_TRIG11_PIO1_24
#undef DMA1_TRIG11_PIO1_25
#undef DMA1_TRIG11_PIO1_26
#undef DMA1_TRIG11_PIO1_27
#undef DMA1_TRIG11_PIO1_28
#undef DMA1_TRIG11_PIO1_29
#undef DMA1_TRIG11_PIO1_30
#undef DMA1_TRIG11_PIO1_31
#undef DMA1_TRIG11_PIO1_6
#undef DMA1_TRIG11_PIO1_7
#undef DMA1_TRIG12_PIO0_17
#undef DMA1_TRIG12_PIO0_18
#undef DMA1_TRIG12_PIO0_28
#undef DMA1_TRIG12_PIO0_31
#undef DMA1_TRIG12_PIO1_0
#undef DMA1_TRIG12_PIO1_1
#undef DMA1_TRIG12_PIO1_24
#undef DMA1_TRIG12_PIO1_25
#undef DMA1_TRIG12_PIO1_26
#undef DMA1_TRIG12_PIO1_27
#undef DMA1_TRIG12_PIO1_28
#undef DMA1_TRIG12_PIO1_29
#undef DMA1_TRIG12_PIO1_30
#undef DMA1_TRIG12_PIO1_31
#undef DMA1_TRIG12_PIO1_6
#undef DMA1_TRIG12_PIO1_7
#undef DMA1_TRIG13_PIO0_17
#undef DMA1_TRIG13_PIO0_18
#undef DMA1_TRIG13_PIO0_28
#undef DMA1_TRIG13_PIO0_31
#undef DMA1_TRIG13_PIO1_0
#undef DMA1_TRIG13_PIO1_1
#undef DMA1_TRIG13_PIO1_24
#undef DMA1_TRIG13_PIO1_25
#undef DMA1_TRIG13_PIO1_26
#undef DMA1_TRIG13_PIO1_27
#undef DMA1_TRIG13_PIO1_28
#undef DMA1_TRIG13_PIO1_29
#undef DMA1_TRIG13_PIO1_30
#undef DMA1_TRIG13_PIO1_31
#undef DMA1_TRIG13_PIO1_6
#undef DMA1_TRIG13_PIO1_7
#undef DMA1_TRIG14_PIO0_17
#undef DMA1_TRIG14_PIO0_18
#undef DMA1_TRIG14_PIO0_28
#undef DMA1_TRIG14_PIO0_31
#undef DMA1_TRIG14_PIO1_0
#undef DMA1_TRIG14_PIO1_1
#undef DMA1_TRIG14_PIO1_24
#undef DMA1_TRIG14_PIO1_25
#undef DMA1_TRIG14_PIO1_26
#undef DMA1_TRIG14_PIO1_27
#undef DMA1_TRIG14_PIO1_28
#undef DMA1_TRIG14_PIO1_29
#undef DMA1_TRIG14_PIO1_30
#undef DMA1_TRIG14_PIO1_31
#undef DMA1_TRIG14_PIO1_6
#undef DMA1_TRIG14_PIO1_7
#undef DMA1_TRIG15_PIO0_17
#undef DMA1_TRIG15_PIO0_18
#undef DMA1_TRIG15_PIO0_28
#undef DMA1_TRIG15_PIO0_31
#undef DMA1_TRIG15_PIO1_0
#undef DMA1_TRIG15_PIO1_1
#undef DMA1_TRIG15_PIO1_24
#undef DMA1_TRIG15_PIO1_25
#undef DMA1_TRIG15_PIO1_26
#undef DMA1_TRIG15_PIO1_27
#undef DMA1_TRIG15_PIO1_28
#undef DMA1_TRIG15_PIO1_29
#undef DMA1_TRIG15_PIO1_30
#undef DMA1_TRIG15_PIO1_31
#undef DMA1_TRIG15_PIO1_6
#undef DMA1_TRIG15_PIO1_7
#undef DMA1_TRIG16_PIO0_17
#undef DMA1_TRIG16_PIO0_18
#undef DMA1_TRIG16_PIO0_28
#undef DMA1_TRIG16_PIO0_31
#undef DMA1_TRIG16_PIO1_0
#undef DMA1_TRIG16_PIO1_1
#undef DMA1_TRIG16_PIO1_24
#undef DMA1_TRIG16_PIO1_25
#undef DMA1_TRIG16_PIO1_26
#undef DMA1_TRIG16_PIO1_27
#undef DMA1_TRIG16_PIO1_28
#undef DMA1_TRIG16_PIO1_29
#undef DMA1_TRIG16_PIO1_30
#undef DMA1_TRIG16_PIO1_31
#undef DMA1_TRIG16_PIO1_6
#undef DMA1_TRIG16_PIO1_7
#undef DMA1_TRIG17_PIO0_17
#undef DMA1_TRIG17_PIO0_18
#undef DMA1_TRIG17_PIO0_28
#undef DMA1_TRIG17_PIO0_31
#undef DMA1_TRIG17_PIO1_0
#undef DMA1_TRIG17_PIO1_1
#undef DMA1_TRIG17_PIO1_24
#undef DMA1_TRIG17_PIO1_25
#undef DMA1_TRIG17_PIO1_26
#undef DMA1_TRIG17_PIO1_27
#undef DMA1_TRIG17_PIO1_28
#undef DMA1_TRIG17_PIO1_29
#undef DMA1_TRIG17_PIO1_30
#undef DMA1_TRIG17_PIO1_31
#undef DMA1_TRIG17_PIO1_6
#undef DMA1_TRIG17_PIO1_7
#undef DMA1_TRIG18_PIO0_17
#undef DMA1_TRIG18_PIO0_18
#undef DMA1_TRIG18_PIO0_28
#undef DMA1_TRIG18_PIO0_31
#undef DMA1_TRIG18_PIO1_0
#undef DMA1_TRIG18_PIO1_1
#undef DMA1_TRIG18_PIO1_24
#undef DMA1_TRIG18_PIO1_25
#undef DMA1_TRIG18_PIO1_26
#undef DMA1_TRIG18_PIO1_27
#undef DMA1_TRIG18_PIO1_28
#undef DMA1_TRIG18_PIO1_29
#undef DMA1_TRIG18_PIO1_30
#undef DMA1_TRIG18_PIO1_31
#undef DMA1_TRIG18_PIO1_6
#undef DMA1_TRIG18_PIO1_7
#undef DMA1_TRIG19_PIO0_17
#undef DMA1_TRIG19_PIO0_18
#undef DMA1_TRIG19_PIO0_28
#undef DMA1_TRIG19_PIO0_31
#undef DMA1_TRIG19_PIO1_0
#undef DMA1_TRIG19_PIO1_1
#undef DMA1_TRIG19_PIO1_24
#undef DMA1_TRIG19_PIO1_25
#undef DMA1_TRIG19_PIO1_26
#undef DMA1_TRIG19_PIO1_27
#undef DMA1_TRIG19_PIO1_28
#undef DMA1_TRIG19_PIO1_29
#undef DMA1_TRIG19_PIO1_30
#undef DMA1_TRIG19_PIO1_31
#undef DMA1_TRIG19_PIO1_6
#undef DMA1_TRIG19_PIO1_7
#undef DMA1_TRIG1_PIO0_17
#undef DMA1_TRIG1_PIO0_18
