zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT685SFAWBR-pinctrl.h
#undef DMA1_TRIG1_PIO0_28
#undef DMA1_TRIG1_PIO0_31
#undef DMA1_TRIG1_PIO1_0
#undef DMA1_TRIG1_PIO1_1
#undef DMA1_TRIG1_PIO1_24
#undef DMA1_TRIG1_PIO1_25
#undef DMA1_TRIG1_PIO1_26
#undef DMA1_TRIG1_PIO1_27
#undef DMA1_TRIG1_PIO1_28
#undef DMA1_TRIG1_PIO1_29
#undef DMA1_TRIG1_PIO1_30
#undef DMA1_TRIG1_PIO1_31
#undef DMA1_TRIG1_PIO1_6
#undef DMA1_TRIG1_PIO1_7
#undef DMA1_TRIG20_PIO0_17
#undef DMA1_TRIG20_PIO0_18
#undef DMA1_TRIG20_PIO0_28
#undef DMA1_TRIG20_PIO0_31
#undef DMA1_TRIG20_PIO1_0
#undef DMA1_TRIG20_PIO1_1
#undef DMA1_TRIG20_PIO1_24
#undef DMA1_TRIG20_PIO1_25
#undef DMA1_TRIG20_PIO1_26
#undef DMA1_TRIG20_PIO1_27
#undef DMA1_TRIG20_PIO1_28
#undef DMA1_TRIG20_PIO1_29
#undef DMA1_TRIG20_PIO1_30
#undef DMA1_TRIG20_PIO1_31
#undef DMA1_TRIG20_PIO1_6
#undef DMA1_TRIG20_PIO1_7
#undef DMA1_TRIG21_PIO0_17
#undef DMA1_TRIG21_PIO0_18
#undef DMA1_TRIG21_PIO0_28
#undef DMA1_TRIG21_PIO0_31
#undef DMA1_TRIG21_PIO1_0
#undef DMA1_TRIG21_PIO1_1
#undef DMA1_TRIG21_PIO1_24
#undef DMA1_TRIG21_PIO1_25
#undef DMA1_TRIG21_PIO1_26
#undef DMA1_TRIG21_PIO1_27
#undef DMA1_TRIG21_PIO1_28
#undef DMA1_TRIG21_PIO1_29
#undef DMA1_TRIG21_PIO1_30
#undef DMA1_TRIG21_PIO1_31
#undef DMA1_TRIG21_PIO1_6
#undef DMA1_TRIG21_PIO1_7
#undef DMA1_TRIG22_PIO0_17
#undef DMA1_TRIG22_PIO0_18
#undef DMA1_TRIG22_PIO0_28
#undef DMA1_TRIG22_PIO0_31
#undef DMA1_TRIG22_PIO1_0
#undef DMA1_TRIG22_PIO1_1
#undef DMA1_TRIG22_PIO1_24
#undef DMA1_TRIG22_PIO1_25
#undef DMA1_TRIG22_PIO1_26
#undef DMA1_TRIG22_PIO1_27
#undef DMA1_TRIG22_PIO1_28
#undef DMA1_TRIG22_PIO1_29
#undef DMA1_TRIG22_PIO1_30
#undef DMA1_TRIG22_PIO1_31
#undef DMA1_TRIG22_PIO1_6
#undef DMA1_TRIG22_PIO1_7
#undef DMA1_TRIG23_PIO0_17
#undef DMA1_TRIG23_PIO0_18
#undef DMA1_TRIG23_PIO0_28
#undef DMA1_TRIG23_PIO0_31
#undef DMA1_TRIG23_PIO1_0
#undef DMA1_TRIG23_PIO1_1
#undef DMA1_TRIG23_PIO1_24
#undef DMA1_TRIG23_PIO1_25
#undef DMA1_TRIG23_PIO1_26
#undef DMA1_TRIG23_PIO1_27
#undef DMA1_TRIG23_PIO1_28
#undef DMA1_TRIG23_PIO1_29
#undef DMA1_TRIG23_PIO1_30
#undef DMA1_TRIG23_PIO1_31
#undef DMA1_TRIG23_PIO1_6
#undef DMA1_TRIG23_PIO1_7
#undef DMA1_TRIG24_PIO0_17
#undef DMA1_TRIG24_PIO0_18
#undef DMA1_TRIG24_PIO0_28
#undef DMA1_TRIG24_PIO0_31
#undef DMA1_TRIG24_PIO1_0
#undef DMA1_TRIG24_PIO1_1
#undef DMA1_TRIG24_PIO1_24
#undef DMA1_TRIG24_PIO1_25
#undef DMA1_TRIG24_PIO1_26
#undef DMA1_TRIG24_PIO1_27
#undef DMA1_TRIG24_PIO1_28
#undef DMA1_TRIG24_PIO1_29
#undef DMA1_TRIG24_PIO1_30
#undef DMA1_TRIG24_PIO1_31
#undef DMA1_TRIG24_PIO1_6
#undef DMA1_TRIG24_PIO1_7
#undef DMA1_TRIG25_PIO0_17
#undef DMA1_TRIG25_PIO0_18
#undef DMA1_TRIG25_PIO0_28
#undef DMA1_TRIG25_PIO0_31
#undef DMA1_TRIG25_PIO1_0
#undef DMA1_TRIG25_PIO1_1
#undef DMA1_TRIG25_PIO1_24
#undef DMA1_TRIG25_PIO1_25
#undef DMA1_TRIG25_PIO1_26
#undef DMA1_TRIG25_PIO1_27
#undef DMA1_TRIG25_PIO1_28
#undef DMA1_TRIG25_PIO1_29
#undef DMA1_TRIG25_PIO1_30
#undef DMA1_TRIG25_PIO1_31
#undef DMA1_TRIG25_PIO1_6
#undef DMA1_TRIG25_PIO1_7
#undef DMA1_TRIG26_PIO0_17
#undef DMA1_TRIG26_PIO0_18
#undef DMA1_TRIG26_PIO0_28
#undef DMA1_TRIG26_PIO0_31
#undef DMA1_TRIG26_PIO1_0
#undef DMA1_TRIG26_PIO1_1
#undef DMA1_TRIG26_PIO1_24
#undef DMA1_TRIG26_PIO1_25
#undef DMA1_TRIG26_PIO1_26
#undef DMA1_TRIG26_PIO1_27
#undef DMA1_TRIG26_PIO1_28
#undef DMA1_TRIG26_PIO1_29
#undef DMA1_TRIG26_PIO1_30
#undef DMA1_TRIG26_PIO1_31
#undef DMA1_TRIG26_PIO1_6
#undef DMA1_TRIG26_PIO1_7
#undef DMA1_TRIG27_PIO0_17
#undef DMA1_TRIG27_PIO0_18
#undef DMA1_TRIG27_PIO0_28
#undef DMA1_TRIG27_PIO0_31
#undef DMA1_TRIG27_PIO1_0
#undef DMA1_TRIG27_PIO1_1
#undef DMA1_TRIG27_PIO1_24
#undef DMA1_TRIG27_PIO1_25
#undef DMA1_TRIG27_PIO1_26
#undef DMA1_TRIG27_PIO1_27
#undef DMA1_TRIG27_PIO1_28
#undef DMA1_TRIG27_PIO1_29
#undef DMA1_TRIG27_PIO1_30
#undef DMA1_TRIG27_PIO1_31
#undef DMA1_TRIG27_PIO1_6
#undef DMA1_TRIG27_PIO1_7
#undef DMA1_TRIG28_PIO0_17
#undef DMA1_TRIG28_PIO0_18
#undef DMA1_TRIG28_PIO0_28
#undef DMA1_TRIG28_PIO0_31
#undef DMA1_TRIG28_PIO1_0
#undef DMA1_TRIG28_PIO1_1
#undef DMA1_TRIG28_PIO1_24
#undef DMA1_TRIG28_PIO1_25
#undef DMA1_TRIG28_PIO1_26
#undef DMA1_TRIG28_PIO1_27
#undef DMA1_TRIG28_PIO1_28
#undef DMA1_TRIG28_PIO1_29
#undef DMA1_TRIG28_PIO1_30
#undef DMA1_TRIG28_PIO1_31
#undef DMA1_TRIG28_PIO1_6
#undef DMA1_TRIG28_PIO1_7
#undef DMA1_TRIG29_PIO0_17
#undef DMA1_TRIG29_PIO0_18
#undef DMA1_TRIG29_PIO0_28
#undef DMA1_TRIG29_PIO0_31
#undef DMA1_TRIG29_PIO1_0
#undef DMA1_TRIG29_PIO1_1
#undef DMA1_TRIG29_PIO1_24
#undef DMA1_TRIG29_PIO1_25
#undef DMA1_TRIG29_PIO1_26
#undef DMA1_TRIG29_PIO1_27
#undef DMA1_TRIG29_PIO1_28
#undef DMA1_TRIG29_PIO1_29
#undef DMA1_TRIG29_PIO1_30
#undef DMA1_TRIG29_PIO1_31
#undef DMA1_TRIG29_PIO1_6
#undef DMA1_TRIG29_PIO1_7
#undef DMA1_TRIG2_PIO0_17
#undef DMA1_TRIG2_PIO0_18
#undef DMA1_TRIG2_PIO0_28
#undef DMA1_TRIG2_PIO0_31
#undef DMA1_TRIG2_PIO1_0
#undef DMA1_TRIG2_PIO1_1
#undef DMA1_TRIG2_PIO1_24
#undef DMA1_TRIG2_PIO1_25
#undef DMA1_TRIG2_PIO1_26
#undef DMA1_TRIG2_PIO1_27
#undef DMA1_TRIG2_PIO1_28
#undef DMA1_TRIG2_PIO1_29
#undef DMA1_TRIG2_PIO1_30
#undef DMA1_TRIG2_PIO1_31
#undef DMA1_TRIG2_PIO1_6
#undef DMA1_TRIG2_PIO1_7
#undef DMA1_TRIG30_PIO0_17
#undef DMA1_TRIG30_PIO0_18
#undef DMA1_TRIG30_PIO0_28
#undef DMA1_TRIG30_PIO0_31
#undef DMA1_TRIG30_PIO1_0
#undef DMA1_TRIG30_PIO1_1
#undef DMA1_TRIG30_PIO1_24
#undef DMA1_TRIG30_PIO1_25
#undef DMA1_TRIG30_PIO1_26
#undef DMA1_TRIG30_PIO1_27
#undef DMA1_TRIG30_PIO1_28
#undef DMA1_TRIG30_PIO1_29
#undef DMA1_TRIG30_PIO1_30
#undef DMA1_TRIG30_PIO1_31
#undef DMA1_TRIG30_PIO1_6
#undef DMA1_TRIG30_PIO1_7
#undef DMA1_TRIG31_PIO0_17
#undef DMA1_TRIG31_PIO0_18
#undef DMA1_TRIG31_PIO0_28
#undef DMA1_TRIG31_PIO0_31
#undef DMA1_TRIG31_PIO1_0
#undef DMA1_TRIG31_PIO1_1
#undef DMA1_TRIG31_PIO1_24
#undef DMA1_TRIG31_PIO1_25
#undef DMA1_TRIG31_PIO1_26
#undef DMA1_TRIG31_PIO1_27
#undef DMA1_TRIG31_PIO1_28
#undef DMA1_TRIG31_PIO1_29
#undef DMA1_TRIG31_PIO1_30
#undef DMA1_TRIG31_PIO1_31
#undef DMA1_TRIG31_PIO1_6
#undef DMA1_TRIG31_PIO1_7
#undef DMA1_TRIG32_PIO0_17
#undef DMA1_TRIG32_PIO0_18
#undef DMA1_TRIG32_PIO0_28
#undef DMA1_TRIG32_PIO0_31
#undef DMA1_TRIG32_PIO1_0
#undef DMA1_TRIG32_PIO1_1
#undef DMA1_TRIG32_PIO1_24
#undef DMA1_TRIG32_PIO1_25
#undef DMA1_TRIG32_PIO1_26
#undef DMA1_TRIG32_PIO1_27
#undef DMA1_TRIG32_PIO1_28
#undef DMA1_TRIG32_PIO1_29
#undef DMA1_TRIG32_PIO1_30
#undef DMA1_TRIG32_PIO1_31
#undef DMA1_TRIG32_PIO1_6
#undef DMA1_TRIG32_PIO1_7
#undef DMA1_TRIG3_PIO0_17
#undef DMA1_TRIG3_PIO0_18
#undef DMA1_TRIG3_PIO0_28
#undef DMA1_TRIG3_PIO0_31
#undef DMA1_TRIG3_PIO1_0
#undef DMA1_TRIG3_PIO1_1
#undef DMA1_TRIG3_PIO1_24
#undef DMA1_TRIG3_PIO1_25
#undef DMA1_TRIG3_PIO1_26
#undef DMA1_TRIG3_PIO1_27
#undef DMA1_TRIG3_PIO1_28
#undef DMA1_TRIG3_PIO1_29
#undef DMA1_TRIG3_PIO1_30
#undef DMA1_TRIG3_PIO1_31
#undef DMA1_TRIG3_PIO1_6
#undef DMA1_TRIG3_PIO1_7
#undef DMA1_TRIG4_PIO0_17
#undef DMA1_TRIG4_PIO0_18
#undef DMA1_TRIG4_PIO0_28
#undef DMA1_TRIG4_PIO0_31
#undef DMA1_TRIG4_PIO1_0
#undef DMA1_TRIG4_PIO1_1
#undef DMA1_TRIG4_PIO1_24
#undef DMA1_TRIG4_PIO1_25
#undef DMA1_TRIG4_PIO1_26
#undef DMA1_TRIG4_PIO1_27
#undef DMA1_TRIG4_PIO1_28
#undef DMA1_TRIG4_PIO1_29
#undef DMA1_TRIG4_PIO1_30
#undef DMA1_TRIG4_PIO1_31
#undef DMA1_TRIG4_PIO1_6
#undef DMA1_TRIG4_PIO1_7
#undef DMA1_TRIG5_PIO0_17
#undef DMA1_TRIG5_PIO0_18
#undef DMA1_TRIG5_PIO0_28
#undef DMA1_TRIG5_PIO0_31
#undef DMA1_TRIG5_PIO1_0
#undef DMA1_TRIG5_PIO1_1
#undef DMA1_TRIG5_PIO1_24
#undef DMA1_TRIG5_PIO1_25
#undef DMA1_TRIG5_PIO1_26
#undef DMA1_TRIG5_PIO1_27
#undef DMA1_TRIG5_PIO1_28
#undef DMA1_TRIG5_PIO1_29
#undef DMA1_TRIG5_PIO1_30
#undef DMA1_TRIG5_PIO1_31
#undef DMA1_TRIG5_PIO1_6
#undef DMA1_TRIG5_PIO1_7
#undef DMA1_TRIG6_PIO0_17
#undef DMA1_TRIG6_PIO0_18
#undef DMA1_TRIG6_PIO0_28
#undef DMA1_TRIG6_PIO0_31
#undef DMA1_TRIG6_PIO1_0
#undef DMA1_TRIG6_PIO1_1
#undef DMA1_TRIG6_PIO1_24
#undef DMA1_TRIG6_PIO1_25
#undef DMA1_TRIG6_PIO1_26
#undef DMA1_TRIG6_PIO1_27
#undef DMA1_TRIG6_PIO1_28
#undef DMA1_TRIG6_PIO1_29
#undef DMA1_TRIG6_PIO1_30
#undef DMA1_TRIG6_PIO1_31
#undef DMA1_TRIG6_PIO1_6
#undef DMA1_TRIG6_PIO1_7
#undef DMA1_TRIG7_PIO0_17
#undef DMA1_TRIG7_PIO0_18
#undef DMA1_TRIG7_PIO0_28
#undef DMA1_TRIG7_PIO0_31
#undef DMA1_TRIG7_PIO1_0
#undef DMA1_TRIG7_PIO1_1
#undef DMA1_TRIG7_PIO1_24
#undef DMA1_TRIG7_PIO1_25
#undef DMA1_TRIG7_PIO1_26
#undef DMA1_TRIG7_PIO1_27
#undef DMA1_TRIG7_PIO1_28
#undef DMA1_TRIG7_PIO1_29
#undef DMA1_TRIG7_PIO1_30
#undef DMA1_TRIG7_PIO1_31
#undef DMA1_TRIG7_PIO1_6
#undef DMA1_TRIG7_PIO1_7
#undef DMA1_TRIG8_PIO0_17
#undef DMA1_TRIG8_PIO0_18
#undef DMA1_TRIG8_PIO0_28
#undef DMA1_TRIG8_PIO0_31
#undef DMA1_TRIG8_PIO1_0
#undef DMA1_TRIG8_PIO1_1
#undef DMA1_TRIG8_PIO1_24
#undef DMA1_TRIG8_PIO1_25
#undef DMA1_TRIG8_PIO1_26
#undef DMA1_TRIG8_PIO1_27
#undef DMA1_TRIG8_PIO1_28
#undef DMA1_TRIG8_PIO1_29
#undef DMA1_TRIG8_PIO1_30
#undef DMA1_TRIG8_PIO1_31
#undef DMA1_TRIG8_PIO1_6
#undef DMA1_TRIG8_PIO1_7
#undef DMA1_TRIG9_PIO0_17
#undef DMA1_TRIG9_PIO0_18
#undef DMA1_TRIG9_PIO0_28
#undef DMA1_TRIG9_PIO0_31
#undef DMA1_TRIG9_PIO1_0
#undef DMA1_TRIG9_PIO1_1
#undef DMA1_TRIG9_PIO1_24
#undef DMA1_TRIG9_PIO1_25
#undef DMA1_TRIG9_PIO1_26
#undef DMA1_TRIG9_PIO1_27
#undef DMA1_TRIG9_PIO1_28
#undef DMA1_TRIG9_PIO1_29
#undef DMA1_TRIG9_PIO1_30
#undef DMA1_TRIG9_PIO1_31
#undef DMA1_TRIG9_PIO1_6
#undef DMA1_TRIG9_PIO1_7
#undef DMIC0_CLK0_1_PIO3_0
#undef DMIC0_CLK2_3_PIO3_1
#undef DMIC0_CLK4_5_PIO3_2
#undef DMIC0_CLK6_7_PIO3_3
#undef DMIC0_DATA0_1_PIO3_4
#undef DMIC0_DATA2_3_PIO3_5
#undef DMIC0_DATA4_5_PIO2_22
#undef DMIC0_DATA4_5_PIO3_6
#undef DMIC0_DATA6_7_PIO2_23
#undef DMIC0_DATA6_7_PIO3_7
#undef FC0_CTS_SDA_SSEL0_PIO3_3
#undef FC0_RTS_SCL_SSEL1_PIO3_4
#undef FC0_RXD_SDA_MOSI_DATA_PIO3_2
#undef FC0_SCK_PIO3_0
#undef FC0_SSEL2_PIO3_5
#undef FC0_SSEL3_PIO3_6
#undef FC0_TXD_SCL_MISO_WS_PIO3_1
#undef FC1_CTS_SDA_SSEL0_PIO7_28
#undef FC1_RTS_SCL_SSEL1_PIO7_29
#undef FC1_RXD_SDA_MOSI_DATA_PIO7_27
#undef FC1_SCK_PIO7_25
#undef FC1_SSEL2_PIO7_30
#undef FC1_SSEL3_PIO7_31
#undef FC1_TXD_SCL_MISO_WS_PIO7_26
#undef FC2_CTS_SDA_SSEL0_PIO0_17
#undef FC2_CTS_SDA_SSEL0_PIO4_8
#undef FC2_RTS_SCL_SSEL1_PIO0_18
#undef FC2_RXD_SDA_MOSI_DATA_PIO7_31
#undef FC2_SCK_PIO7_24
#undef FC2_TXD_SCL_MISO_WS_PIO7_30
#undef FC3_SSEL2_PIO0_31
#undef FC3_SSEL3_PIO1_0
#undef FC4_CTS_SDA_SSEL0_PIO0_31
#undef FC4_RTS_SCL_SSEL1_PIO1_0
#undef FC4_SCK_PIO0_28
#undef FC4_SSEL2_PIO1_1
#undef FC4_SSEL2_PIO1_6
#undef FC4_SSEL3_PIO1_7
#undef FC5_CTS_SDA_SSEL0_PIO1_6
#undef FC5_CTS_SDA_SSEL0_PIO3_18
#undef FC5_RTS_SCL_SSEL1_PIO1_7
#undef FC5_RTS_SCL_SSEL1_PIO3_22
#undef FC5_RXD_SDA_MOSI_DATA_PIO3_17
#undef FC5_SCK_PIO3_15
#undef FC5_SSEL2_PIO0_17
#undef FC5_SSEL2_PIO3_23
#undef FC5_SSEL3_PIO0_18
#undef FC5_SSEL3_PIO3_24
#undef FC5_TXD_SCL_MISO_WS_PIO3_16
#undef FC6_CTS_SDA_SSEL0_PIO3_28
#undef FC6_RTS_SCL_SSEL1_PIO3_29
#undef FC6_SCK_PIO3_25
#undef FC6_SSEL2_PIO3_30
#undef FC6_SSEL3_PIO3_31
#undef FC7_CTS_SDA_SSEL0_PIO4_3
#undef FC7_RTS_SCL_SSEL1_PIO4_4
#undef FC7_RXD_SDA_MOSI_DATA_PIO4_2
#undef FC7_SCK_PIO4_0
#undef FC7_SSEL2_PIO4_5
#undef FC7_SSEL3_PIO4_6
#undef FC7_TXD_SCL_MISO_WS_PIO4_1
#undef FLEXSPI0A_DATA4_PIO1_24
#undef FLEXSPI0A_DATA5_PIO1_25
#undef FLEXSPI0A_DATA6_PIO1_26
#undef FLEXSPI0A_DATA7_PIO1_27
#undef FLEXSPI0A_DQS_PIO1_28
#undef FLEXSPI0A_SS1_N_PIO1_29
#undef FLEXSPI0B_DATA6_PIO2_22
#undef FLEXSPI0B_DATA7_PIO2_23
#undef FLEXSPI0B_SCLK_PIO1_29
#undef FREQME_IN0_PIO4_0
#undef FREQME_IN1_PIO4_0
#undef GPIO_INT_BMAT_PIO2_24
#undef GPIO_INT_BMAT_PIO3_21
#undef GPIO_INT_BMAT_PIO4_9
#undef GPIO_PIO017_PIO0_17
#undef GPIO_PIO018_PIO0_18
#undef GPIO_PIO028_PIO0_28
#undef GPIO_PIO031_PIO0_31
#undef GPIO_PIO10_PIO1_0
#undef GPIO_PIO11_PIO1_1
#undef GPIO_PIO124_PIO1_24
#undef GPIO_PIO125_PIO1_25
#undef GPIO_PIO126_PIO1_26
#undef GPIO_PIO127_PIO1_27
#undef GPIO_PIO128_PIO1_28
#undef GPIO_PIO129_PIO1_29
#undef GPIO_PIO130_PIO1_30
#undef GPIO_PIO131_PIO1_31
#undef GPIO_PIO16_PIO1_6
#undef GPIO_PIO17_PIO1_7
#undef GPIO_PIO20_PIO2_0
#undef GPIO_PIO210_PIO2_10
#undef GPIO_PIO211_PIO2_11
#undef GPIO_PIO212_PIO2_12
#undef GPIO_PIO213_PIO2_13
#undef GPIO_PIO21_PIO2_1
#undef GPIO_PIO222_PIO2_22
#undef GPIO_PIO223_PIO2_23
#undef GPIO_PIO224_PIO2_24
#undef GPIO_PIO22_PIO2_2
#undef GPIO_PIO23_PIO2_3
#undef GPIO_PIO24_PIO2_4
#undef GPIO_PIO25_PIO2_5
#undef GPIO_PIO26_PIO2_6
#undef GPIO_PIO27_PIO2_7
#undef GPIO_PIO28_PIO2_8
#undef GPIO_PIO29_PIO2_9
#undef GPIO_PIO30_PIO3_0
#undef GPIO_PIO310_PIO3_10
#undef GPIO_PIO311_PIO3_11
#undef GPIO_PIO312_PIO3_12
#undef GPIO_PIO313_PIO3_13
#undef GPIO_PIO314_PIO3_14
#undef GPIO_PIO315_PIO3_15
#undef GPIO_PIO316_PIO3_16
#undef GPIO_PIO317_PIO3_17
#undef GPIO_PIO318_PIO3_18
#undef GPIO_PIO319_PIO3_19
#undef GPIO_PIO31_PIO3_1
#undef GPIO_PIO320_PIO3_20
#undef GPIO_PIO321_PIO3_21
#undef GPIO_PIO322_PIO3_22
#undef GPIO_PIO323_PIO3_23
#undef GPIO_PIO324_PIO3_24
#undef GPIO_PIO325_PIO3_25
#undef GPIO_PIO328_PIO3_28
#undef GPIO_PIO329_PIO3_29
#undef GPIO_PIO32_PIO3_2
#undef GPIO_PIO330_PIO3_30
#undef GPIO_PIO331_PIO3_31
#undef GPIO_PIO33_PIO3_3
#undef GPIO_PIO34_PIO3_4
#undef GPIO_PIO35_PIO3_5
#undef GPIO_PIO36_PIO3_6
#undef GPIO_PIO37_PIO3_7
#undef GPIO_PIO38_PIO3_8
#undef GPIO_PIO39_PIO3_9
#undef GPIO_PIO40_PIO4_0
#undef GPIO_PIO41_PIO4_1
#undef GPIO_PIO42_PIO4_2
#undef GPIO_PIO43_PIO4_3
#undef GPIO_PIO44_PIO4_4
#undef GPIO_PIO45_PIO4_5
#undef GPIO_PIO46_PIO4_6
#undef GPIO_PIO47_PIO4_7
#undef GPIO_PIO48_PIO4_8
#undef GPIO_PIO49_PIO4_9
#undef GPIO_PIO724_PIO7_24
#undef GPIO_PIO725_PIO7_25
#undef GPIO_PIO726_PIO7_26
#undef GPIO_PIO727_PIO7_27
#undef GPIO_PIO728_PIO7_28
#undef GPIO_PIO729_PIO7_29
#undef GPIO_PIO730_PIO7_30
#undef GPIO_PIO731_PIO7_31
#undef I2S_BRIDGE_CLK_OUT_PIO0_28
#undef MCLK_PIO3_19
#undef MCLK_PIO4_7
#undef PINT_PINT0_PIO0_17
#undef PINT_PINT0_PIO0_18
#undef PINT_PINT0_PIO0_28
#undef PINT_PINT0_PIO0_31
#undef PINT_PINT0_PIO1_0
#undef PINT_PINT0_PIO1_1
#undef PINT_PINT0_PIO1_24
#undef PINT_PINT0_PIO1_25
#undef PINT_PINT0_PIO1_26
#undef PINT_PINT0_PIO1_27
#undef PINT_PINT0_PIO1_28
#undef PINT_PINT0_PIO1_29
#undef PINT_PINT0_PIO1_30
#undef PINT_PINT0_PIO1_31
#undef PINT_PINT0_PIO1_6
#undef PINT_PINT0_PIO1_7
#undef PINT_PINT1_PIO0_17
#undef PINT_PINT1_PIO0_18
#undef PINT_PINT1_PIO0_28
#undef PINT_PINT1_PIO0_31
#undef PINT_PINT1_PIO1_0
#undef PINT_PINT1_PIO1_1
#undef PINT_PINT1_PIO1_24
#undef PINT_PINT1_PIO1_25
#undef PINT_PINT1_PIO1_26
#undef PINT_PINT1_PIO1_27
#undef PINT_PINT1_PIO1_28
#undef PINT_PINT1_PIO1_29
#undef PINT_PINT1_PIO1_30
#undef PINT_PINT1_PIO1_31
#undef PINT_PINT1_PIO1_6
#undef PINT_PINT1_PIO1_7
#undef PINT_PINT2_PIO0_17
#undef PINT_PINT2_PIO0_18
#undef PINT_PINT2_PIO0_28
#undef PINT_PINT2_PIO0_31
#undef PINT_PINT2_PIO1_0
#undef PINT_PINT2_PIO1_1
#undef PINT_PINT2_PIO1_24
#undef PINT_PINT2_PIO1_25
#undef PINT_PINT2_PIO1_26
#undef PINT_PINT2_PIO1_27
#undef PINT_PINT2_PIO1_28
#undef PINT_PINT2_PIO1_29
#undef PINT_PINT2_PIO1_30
#undef PINT_PINT2_PIO1_31
#undef PINT_PINT2_PIO1_6
#undef PINT_PINT2_PIO1_7
#undef PINT_PINT3_PIO0_17
#undef PINT_PINT3_PIO0_18
#undef PINT_PINT3_PIO0_28
#undef PINT_PINT3_PIO0_31
#undef PINT_PINT3_PIO1_0
#undef PINT_PINT3_PIO1_1
#undef PINT_PINT3_PIO1_24
#undef PINT_PINT3_PIO1_25
#undef PINT_PINT3_PIO1_26
#undef PINT_PINT3_PIO1_27
#undef PINT_PINT3_PIO1_28
#undef PINT_PINT3_PIO1_29
#undef PINT_PINT3_PIO1_30
#undef PINT_PINT3_PIO1_31
#undef PINT_PINT3_PIO1_6
#undef PINT_PINT3_PIO1_7
#undef PINT_PINT4_PIO0_17
#undef PINT_PINT4_PIO0_18
#undef PINT_PINT4_PIO0_28
#undef PINT_PINT4_PIO0_31
#undef PINT_PINT4_PIO1_0
#undef PINT_PINT4_PIO1_1
#undef PINT_PINT4_PIO1_24
#undef PINT_PINT4_PIO1_25
#undef PINT_PINT4_PIO1_26
#undef PINT_PINT4_PIO1_27
#undef PINT_PINT4_PIO1_28
#undef PINT_PINT4_PIO1_29
#undef PINT_PINT4_PIO1_30
#undef PINT_PINT4_PIO1_31
#undef PINT_PINT4_PIO1_6
#undef PINT_PINT4_PIO1_7
#undef PINT_PINT5_PIO0_17
#undef PINT_PINT5_PIO0_18
#undef PINT_PINT5_PIO0_28
#undef PINT_PINT5_PIO0_31
#undef PINT_PINT5_PIO1_0
#undef PINT_PINT5_PIO1_1
#undef PINT_PINT5_PIO1_24
#undef PINT_PINT5_PIO1_25
#undef PINT_PINT5_PIO1_26
#undef PINT_PINT5_PIO1_27
#undef PINT_PINT5_PIO1_28
#undef PINT_PINT5_PIO1_29
#undef PINT_PINT5_PIO1_30
#undef PINT_PINT5_PIO1_31
#undef PINT_PINT5_PIO1_6
#undef PINT_PINT5_PIO1_7
#undef PINT_PINT6_PIO0_17
#undef PINT_PINT6_PIO0_18
#undef PINT_PINT6_PIO0_28
#undef PINT_PINT6_PIO0_31
#undef PINT_PINT6_PIO1_0
#undef PINT_PINT6_PIO1_1
#undef PINT_PINT6_PIO1_24
#undef PINT_PINT6_PIO1_25
#undef PINT_PINT6_PIO1_26
#undef PINT_PINT6_PIO1_27
#undef PINT_PINT6_PIO1_28
#undef PINT_PINT6_PIO1_29
#undef PINT_PINT6_PIO1_30
#undef PINT_PINT6_PIO1_31
#undef PINT_PINT6_PIO1_6
#undef PINT_PINT6_PIO1_7
#undef PINT_PINT7_PIO0_17
#undef PINT_PINT7_PIO0_18
#undef PINT_PINT7_PIO0_28
#undef PINT_PINT7_PIO0_31
#undef PINT_PINT7_PIO1_0
#undef PINT_PINT7_PIO1_1
#undef PINT_PINT7_PIO1_24
#undef PINT_PINT7_PIO1_25
#undef PINT_PINT7_PIO1_26
#undef PINT_PINT7_PIO1_27
#undef PINT_PINT7_PIO1_28
#undef PINT_PINT7_PIO1_29
#undef PINT_PINT7_PIO1_30
#undef PINT_PINT7_PIO1_31
#undef PINT_PINT7_PIO1_6
#undef PINT_PINT7_PIO1_7
#undef PMIC_I2C_SCL
#undef PMIC_I2C_SDA
#undef SCT0_IN0_PIO0_17
#undef SCT0_IN0_PIO0_18
#undef SCT0_IN0_PIO0_31
#undef SCT0_IN0_PIO1_0
#undef SCT0_IN0_PIO1_1
#undef SCT0_IN0_PIO1_24
#undef SCT0_IN0_PIO1_26
#undef SCT0_IN0_PIO1_28
#undef SCT0_IN0_PIO1_30
#undef SCT0_IN0_PIO1_31
#undef SCT0_IN0_PIO1_6
#undef SCT0_IN0_PIO1_7
#undef SCT0_IN0_PIO2_0
#undef SCT0_IN0_PIO2_1
#undef SCT0_IN0_PIO2_10
#undef SCT0_IN0_PIO2_11
#undef SCT0_IN0_PIO2_6
#undef SCT0_IN0_PIO2_7
#undef SCT0_IN0_PIO3_19
#undef SCT0_IN0_PIO4_7
#undef SCT0_IN1_PIO0_17
#undef SCT0_IN1_PIO0_18
#undef SCT0_IN1_PIO0_31
#undef SCT0_IN1_PIO1_0
#undef SCT0_IN1_PIO1_1
#undef SCT0_IN1_PIO1_24
#undef SCT0_IN1_PIO1_26
#undef SCT0_IN1_PIO1_28
#undef SCT0_IN1_PIO1_30
#undef SCT0_IN1_PIO1_31
#undef SCT0_IN1_PIO1_6
#undef SCT0_IN1_PIO1_7
#undef SCT0_IN1_PIO2_0
#undef SCT0_IN1_PIO2_1
#undef SCT0_IN1_PIO2_10
#undef SCT0_IN1_PIO2_11
#undef SCT0_IN1_PIO2_6
#undef SCT0_IN1_PIO2_7
#undef SCT0_IN1_PIO3_19
#undef SCT0_IN1_PIO4_7
#undef SCT0_IN2_PIO0_17
#undef SCT0_IN2_PIO0_18
#undef SCT0_IN2_PIO0_31
#undef SCT0_IN2_PIO1_0
#undef SCT0_IN2_PIO1_1
#undef SCT0_IN2_PIO1_24
#undef SCT0_IN2_PIO1_26
#undef SCT0_IN2_PIO1_28
#undef SCT0_IN2_PIO1_30
#undef SCT0_IN2_PIO1_31
#undef SCT0_IN2_PIO1_6
#undef SCT0_IN2_PIO1_7
#undef SCT0_IN2_PIO2_0
#undef SCT0_IN2_PIO2_1
#undef SCT0_IN2_PIO2_10
#undef SCT0_IN2_PIO2_11
#undef SCT0_IN2_PIO2_6
#undef SCT0_IN2_PIO2_7
#undef SCT0_IN2_PIO3_19
#undef SCT0_IN2_PIO4_7
#undef SCT0_IN3_PIO0_17
#undef SCT0_IN3_PIO0_18
#undef SCT0_IN3_PIO0_31
#undef SCT0_IN3_PIO1_0
#undef SCT0_IN3_PIO1_1
#undef SCT0_IN3_PIO1_24
#undef SCT0_IN3_PIO1_26
#undef SCT0_IN3_PIO1_28
#undef SCT0_IN3_PIO1_30
#undef SCT0_IN3_PIO1_31
#undef SCT0_IN3_PIO1_6
#undef SCT0_IN3_PIO1_7
#undef SCT0_IN3_PIO2_0
#undef SCT0_IN3_PIO2_1
#undef SCT0_IN3_PIO2_10
#undef SCT0_IN3_PIO2_11
#undef SCT0_IN3_PIO2_6
#undef SCT0_IN3_PIO2_7
#undef SCT0_IN3_PIO3_19
#undef SCT0_IN3_PIO4_7
#undef SCT0_IN4_PIO0_17
#undef SCT0_IN4_PIO0_18
#undef SCT0_IN4_PIO0_31
#undef SCT0_IN4_PIO1_0
#undef SCT0_IN4_PIO1_1
#undef SCT0_IN4_PIO1_24
#undef SCT0_IN4_PIO1_26
#undef SCT0_IN4_PIO1_28
#undef SCT0_IN4_PIO1_30
#undef SCT0_IN4_PIO1_31
#undef SCT0_IN4_PIO1_6
#undef SCT0_IN4_PIO1_7
#undef SCT0_IN4_PIO2_0
#undef SCT0_IN4_PIO2_1
#undef SCT0_IN4_PIO2_10
#undef SCT0_IN4_PIO2_11
#undef SCT0_IN4_PIO2_6
#undef SCT0_IN4_PIO2_7
#undef SCT0_IN4_PIO3_19
#undef SCT0_IN4_PIO4_7
#undef SCT0_IN5_PIO0_17
#undef SCT0_IN5_PIO0_18
#undef SCT0_IN5_PIO0_31
#undef SCT0_IN5_PIO1_0
#undef SCT0_IN5_PIO1_1
#undef SCT0_IN5_PIO1_24
#undef SCT0_IN5_PIO1_26
#undef SCT0_IN5_PIO1_28
#undef SCT0_IN5_PIO1_30
#undef SCT0_IN5_PIO1_31
#undef SCT0_IN5_PIO1_6
#undef SCT0_IN5_PIO1_7
#undef SCT0_IN5_PIO2_0
#undef SCT0_IN5_PIO2_1
#undef SCT0_IN5_PIO2_10
#undef SCT0_IN5_PIO2_11
#undef SCT0_IN5_PIO2_6
#undef SCT0_IN5_PIO2_7
#undef SCT0_IN5_PIO3_19
#undef SCT0_IN5_PIO4_7
#undef SCT0_IN6_PIO0_17
#undef SCT0_IN6_PIO0_18
#undef SCT0_IN6_PIO0_31
#undef SCT0_IN6_PIO1_0
#undef SCT0_IN6_PIO1_1
#undef SCT0_IN6_PIO1_24
#undef SCT0_IN6_PIO1_26
#undef SCT0_IN6_PIO1_28
#undef SCT0_IN6_PIO1_30
#undef SCT0_IN6_PIO1_31
#undef SCT0_IN6_PIO1_6
#undef SCT0_IN6_PIO1_7
#undef SCT0_IN6_PIO2_0
#undef SCT0_IN6_PIO2_1
#undef SCT0_IN6_PIO2_10
#undef SCT0_IN6_PIO2_11
#undef SCT0_IN6_PIO2_6
#undef SCT0_IN6_PIO2_7
#undef SCT0_IN6_PIO3_19
#undef SCT0_IN6_PIO4_7
#undef SCT0_OUT0_PIO2_2
#undef SCT0_OUT1_PIO2_3
#undef SCT0_OUT2_PIO2_4
#undef SCT0_OUT3_PIO0_17
#undef SCT0_OUT3_PIO1_25
#undef SCT0_OUT3_PIO2_5
#undef SCT0_OUT4_PIO1_27
#undef SCT0_OUT4_PIO1_6
#undef SCT0_OUT4_PIO2_8
#undef SCT0_OUT5_PIO1_29
#undef SCT0_OUT5_PIO1_7
#undef SCT0_OUT5_PIO2_9
#undef SCT0_OUT6_PIO0_18
#undef SCT0_OUT6_PIO0_31
#undef SCT0_OUT6_PIO2_12
#undef SCT0_OUT7_PIO1_0
#undef SCT0_OUT7_PIO2_13
#undef SCT0_OUT8_PIO1_1
#undef SD0_CARD_DET_N_PIO2_9
#undef SD0_CLK_PIO1_30
#undef SD0_CMD_PIO1_31
#undef SD0_DS_PIO2_4
#undef SD0_RESET_N_PIO2_10
#undef SD0_VOLT_PIO2_11
#undef SD0_WR_PRT_PIO2_4
#undef SD1_CARD_DET_N_PIO3_19
#undef SD1_CLK_PIO3_8
#undef SD1_CMD_PIO3_9
#undef SD1_RESET_N_PIO3_20
#undef SD1_VOLT_PIO3_21
#undef SD1_WR_PRT_PIO3_14
#undef SECGPIO_SECPIO017_PIO0_17
#undef SECGPIO_SECPIO018_PIO0_18
#undef SECGPIO_SECPIO028_PIO0_28
#undef SECGPIO_SECPIO031_PIO0_31
#undef SWO_PIO2_24
#undef USDHC0_USDHC_DATA0_PIO2_0
#undef USDHC0_USDHC_DATA1_PIO2_1
#undef USDHC0_USDHC_DATA2_PIO2_2
#undef USDHC0_USDHC_DATA3_PIO2_3
#undef USDHC0_USDHC_DATA4_PIO2_5
#undef USDHC0_USDHC_DATA5_PIO2_6
#undef USDHC0_USDHC_DATA6_PIO2_7
#undef USDHC0_USDHC_DATA7_PIO2_8
#undef USDHC1_USDHC_DATA0_PIO3_10
#undef USDHC1_USDHC_DATA1_PIO3_11
#undef USDHC1_USDHC_DATA2_PIO3_12
#undef USDHC1_USDHC_DATA3_PIO3_13
#undef USDHC1_USDHC_DATA4_PIO3_15
#undef USDHC1_USDHC_DATA5_PIO3_16
#undef USDHC1_USDHC_DATA6_PIO3_17
#undef USDHC1_USDHC_DATA7_PIO3_18
#undef UTICK0_CAPTURE2_PIO1_29

#endif /* _ZEPHYR_DTS_BINDING_MIMXRT685SFAWBR_WRAPPER_ */
